Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Редактировать Редактировать — для выделенных полей открывает окно выбора доступных вариантов агрегации;
en: Edit Edit enables to open the selection window of the available aggregation options for the selected fields.

source: Редактировать Редактировать — задание параметров выражения;
en: Edit Edit enables to set expression parameters.

source: Редактировать Редактировать — позволяет отредактировать добавленную в список строку.
en: Edit Edit enables to edit the row added to the list.

source: Редактировать Редактировать — редактировать выделенную папку;
en: Edit Edit enables to edit the selected folder.

source: Редактировать Редактировать — редактировать пользователя;
en: Edit Edit: edit user.

source: Редактировать — для выделенных полей открывает окно выбора доступных вариантов агрегации;
en: Edit enables to open the selection window of the available aggregation options for the selected fields.

source: Редакции платформы
en: Platform editions

source: Режим активации узла
en: Node activation mode

source: Режим журнала транзакций — устанавливается режим работы журнала транзакций.
en: Transaction journal mode: the transaction journal mode is set.

source: Режим отладки Режим отладки — применяется для проверки корректности данных на выходных портах вне зависимости от условий.
en: Debug mode Debug mode will be used to check data correctness at the output ports regardless of conditions.

source: Режим отображения Дерево.
en: Tree representation mode.

source: Режим отображения Таблица.
en: Table representation mode.

source: Режим работы LIKE — предлагается выбрать один из вариантов сравнения символов при использовании функции LIKE.
en: LIKE Mode: it is required to select one of the character collation options to use LIKE function.

source: Режим синхронизации — устанавливается режим синхронизации с файловой системой.
en: Sync mode enables to set the mode of synchronization with the file system.

source: Резервный источник WSDL — указывается резервный источник WSDL, который будет использован программой, если не удастся получить основной источник, либо если при разборе основного WSDL возникнут ошибки.
en: Reserve WSDL source: the reserve WSDL source is specified. It will be used by the application if the main source is not available, or if errors occur while parsing the main WSDL.

source: Результат — в табличной части окна мастера будет показан результат преобразования данных с учетом установленных параметров полей.
en: Result: result of data transformation will be displayed in the table wizard part, taking into account the set parameters of fields.

source: Результат — итоговое форматирование, применённое к примеру.
en: Result: the final formatting applied to the example.

source: Результирующий сценарий.
en: Resulting Workflow

source: Роли пользователей
en: User roles

source: Российская СУБД (Postgres Pro), разработанная на основе свободно-распространяемой СУБД PostgreSQL.
en: The Russian DBMS (Postgres Pro) based on free open-source DBMS PostgreSQL.

source: Ручная настройка — при установке данного флага становится доступным выбор диапазона значений.
en: Manual setting: when this checkbox is selected, it becomes possible to select the range of values.

source: С начала — искомый фрагмент находится только в начале значения;
en: From the start: the searched fragment is only in the value start.

source: С разделителями — значения полей в исходном файле отделяются символом, заданным параметром Разделитель столбцов.
en: With separators: this option means values of fields in the source file that are separated by the character set by the Column delimiter parameter.

source: С расчетом долей по всей выборке — процентное соотношение долей для разгруппировки будет таким же, как и у значений поля опорной таблицы, выбранного для расчета долей.
en: With calculation of quotas for total sample: percentage of quotas for ungrouping will be the same as for the field values of the reference table selected for calculation of quotas.

source: С учетом временных колебаний и сезонности опорных данных — применяется для разгруппировки временного ряда данных.
en: Given time variations and seasonality of the reference data: it is applied for ungrouping of the data time series.

source: Сondition negative (N) — фактическое количество отрицательных примеров.
en: Сondition negative (N): the real number of negative cases.

source: Сondition positive (P) — фактическое количество положительных примеров.
en: Сondition positive (P): the real number of positive cases.

source: Сайт с описанием правил и примеров написания строк подключения
en: Site with rules and examples of connection string writing;

source: Самоорганизующиеся сети.
en: Self-organizing networks.

source: Свернуть все.
en: Collapse all.

source: Свернуть дерево Свернуть дерево — свернуть дерево вариантов агрегации и способов отображения;
en: Collapse tree Collapse tree enables to collapse the tree of aggregation options and representation methods.

source: Свернуть колонки.
en: Collapse columns.

source: Свернуть строки.
en: Collapse rows.

source: Сводка
en: Summary

source: Связи — графически отображающий связи между полями/переменными входного и выходного наборов порта;
en: Links: graphically displayed links between the fields/variables of the input and output data sets of the port.

source: Связывание объектов — представлены списки полей входной таблицы и элементов схемы результирующего XML.
en: Object linking: lists of the input table fields and items of the resulting XML schema are represented.

source: Связывание объектов — список полей экспортируемой таблицы и иерархической структуры XML, которые необходимо соотнести друг с другом.
en: Object linking: the list of the exported table fields and hierarchic XML structure that are required to map to each other.

source: Связь
en: Link

source: Свёртка столбцов
en: Collapse columns

source: Свёртка столбцов Свёртка столбцов
en: Collapse Columns Collapse Columns

source: Сглаженные области Сглаженные области.
en: Smoothed areas Smoothed areas.

source: Сезонный индекс (1, 2, 3, ...) — количество полей с сезонными индексами указывается в мастере настройки.
en: Seasonal index (1, 2, 3, ...): the number of fields with seasonal indexes is specified in the wizard.

source: Секунды.
en: Seconds.

source: Семантический слой — это специальный механизм, позволяющий аналитику пользоваться данными посредством бизнес-терминов предметной области.
en: Semantic layer is a special mechanism that lets an analyst use data by means of the subject area business terms.

source: Сервер — хост SQL-сервера.
en: Server: the SQL server host.

source: Сервер — хост сервера Firebird.
en: Server: the Firebird server host.

source: Сервер — хост сервера MySQL.
en: Server: MySQL server host.

source: Сервер — хост сервера PostgreSQL.
en: Server: the PostgreSQL server host.

source: Серий — количество отображаемых серий.
en: Series: the number of displayed series.

source: Сертификат CA — путь к файлу с корневым сертификатом.
en: CA certificate: path to the file with the root certificate.

source: Сертификат пользователя — путь к файлу с клиентским сертификатом.
en: User certificate: path to the file with the client certificate.

source: Скользящее окно
en: Lag

source: Скользящее окно Скользящее окно
en: Lag Lag

source: Скользящие уникальные значения — заново создает колонки из уникальных значений поля (полей).
en: Sliding unique values enable to create columns from the unique field (fields) values.

source: Скользящие уникальные значения — установка флага позволяет заново создавать колонки из уникальных значений поля (полей).
en: Sliding unique values: the checkbox selection enables to create columns from the unique field (fields) values again.

source: Скорректированный коэффициент детерминации
en: Adjusted determination coefficient

source: Скорректированный коэффициент детерминации.
en: Adjusted determination coefficient.

source: Скрывать неиспользуемые поля — скрыть неиспользуемые в кластеризации поля (их значимость не определена).
en: Hide unused fields: hide the fields unused in clustering (their importance is not defined).

source: Скрытое — навигация по объектам, не поместившимся в Адресную строку.
en: Hidden: navigation through the objects for which there's no enough place in Address bar.

source: Скрыть Скрыть.
en: Hide Hide.

source: Слияние
en: Join

source: Слияние Слияние
en: Join Join

source: Служебные порты
en: Service ports

source: Случайный — записи случайным образом выбираются из исходного набора данных и помещаются в результирующую выборку.
en: Random: the records are randomly selected from the source data set, and then they are placed into the resulting sample.

source: Смещение порта вниз Переместить вниз, Смещение порта вверх Переместить вверх — путем смещения выделенного порта определить его положение относительно узла компонента.
en: Move port down Move down, Move port up Move up: it is possible to define location of the selected port relative to the component node by moving it.

source: Смотри также:
en: See also:

source: Событие — выводит метку выходного поля и значение являющееся событием.
en: Event displays the output field caption and the value that is an event.

source: Совместимость типов данных
en: Compatibility of data types

source: Содержащие выбранные элементы — задает поля вспомогательного набора данных, содержащие дополнительные элементы транзакций.
en: Containing selected items enables to set the supplementary data set fields that contain supplementary transaction items.

source: Соединение (переменные)
en: Union (variables)

source: Соединение портов.
en: Connection of Ports.

source: Соединение-переменные Соединение (переменные)
en: Variable Union Variable Union

source: Создавать БД, если не существует — при установке флага, указанная в параметре Строка подключения база данных будет создана, если таковая не существует.
en: Create DB if it doesn't exist: when this checkbox is selected, the database specified in the Connection string parameter will be created if it doesn't exist.

source: Создание выхода Передавать на выход — для выделенного входного порта будет создан порт выхода в каждой ветви.
en: Create output Pass to output: the output port will be created in each branch for the selected input port.

source: Создание нового подключения
en: Create New Connection

source: Создание новой таблицы
en: Create new table

source: Создание узла подключения в сценарии
en: Creation of the connection node in the workflow

source: Создать новый пакет — позволяет создать и сохранить новый Пакет;
en: New Package enables to create and save a new Package.

source: Создать новый порт Добавить — создать новый порт входа:
en: Create new port Add enables to create a new input port as follows:

source: Создать новый — создание нового Пакета;
en: New enables to create a new Package.

source: Создать пакет — создание нового пакета, программа сразу попросить указать путь, куда сохранить пакет.
en: New package — creation of the new package. You will be asked to show the path to save the package.

source: Создать черновик — позволяет создать временный Пакет и работать с ним, не сохраняя его;
en: New Draft enables to create a temporary Package and work with it without saving.

source: Создать черновик — создание временного Пакета, не сохраняя его;
en: New Draft enables to create a temporary Package without its saving.

source: Создать черновик — создание нового пакета без предварительного сохранения.
en: New Draft — creation of the new package without preliminary saving.

source: Сокрытие/отображение столбцов легенды — показать/скрыть столбцы легенды, для этого необходимо в их заголовочном меню по клику на кнопку Раскрыть выбрать пункт меню Столбцы Столбцы и снять/установить галочки на столбцах, которые необходимо скрыть или показать.
en: Hide/display legend columns: show/hide legend columns. For this purpose, it is required to click on Open button in their caption menu, select Columns Columns menu option and check/uncheck the columns to be hidden or shown.

source: Соответствует условию Соответствуют условию (таблица данных);
en: Meet criterion Meet criterion (data table).

source: Сортировать результирующие данные — данные в результирующей таблице будут отсортированы по полям группировки в зависимости от их последовательности расположения в списке Группы.
en: Sort result data: the data in the resulting table will be sorted by the grouping fields according to their location sequence in the Groups list.

source: Сортировать Сортировать — сортировка таблицы по полю исходного значения.
en: Sort Sort enables to sort the table by field of the source value.

source: Сортировка Сортировка — открыть окно для настройки сортировки данных по столбцам.
en: Sort Sort: open data sorting configuration window by columns.

source: Сортировка Сортировка — сортировка таблицы по полю исходного значения;
en: Sort Sort enables to sort the table by field of the source value.

source: Состояние входа — при активном состоянии позволяет использовать входные данные.
en: Login status: it enables to use the input data when the status is active.

source: Состояние входа — строка состояния входа Источник данных.
en: Login status: login status row - Data source.

source: Сохранение пакета.
en: Save Package

source: Сохранить как — сохранение Пакета в выбранной директории;
en: Save as enables to save a Package in the selected directory.

source: Сохранить пароль — при установке этого флага логин и пароль будут сохранены в текущих настройках подключения.
en: Save password: when selecting this checkbox, login and password will be saved in the current connection settings.

source: Сохранить Сохранить — сохраняет полученные изменения параметров;
en: Save Save enables to save introduced changes of parameters.

source: Сохранить — сохранение Пакета или его изменений в текущей директории;
en: Save enables to save or change a Package in the current directory.

source: Сохранять пароль — при установке этого флага логин и пароль будут сохранены в текущих настройках подключения.
en: Save password: when selecting this checkbox, login and password will be saved in the current connection settings.

source: Сохранять пароль — подключении к файлу Microsoft Excel этот параметр не используются;
en: Save password: when connecting to the Microsoft Excel file, this parameter is not used.

source: Сохранять пароль — при установке этого флага логин и пароль будут сохранены в текущих настройках подключения;
en: Save password: when selecting this checkbox, login and password will be saved in the current connection settings.

source: Сохранять пароль — при установке этого флага пароль будет сохранен в текущих настройках подключения;
en: Save password: when selecting this checkbox, password will be saved in the current connection settings.

source: Сохранять текст запроса на диск — все запросы, отправленные сервису, записываются в указанную папку в файловом хранилище.
en: Save Request Text to Disk: all requests sent to the service are written to the specified folder in the file storage.

source: Сохранять текст запроса на диск — все запросы, отправленные сервису, записываются в указанную папку в файловом хранилище;
en: Save Request Text to Disk: all requests sent to the service are written to the specified folder in the file storage.

source: Спирмена — коэффициенты корреляции Спирмена.
en: Spearman: the Spearman's rank correlation coefficient.

source: Список Таблицы/Представления — в списке осуществляется выбор доступных для импорта таблиц и представлений источника данных.
en: List Tables/Views. The data source tables and views available for import are selected from the list.

source: Список ветвей условия — содержит варианты дальнейшего выполнения сценария.
en: Condition branch list contains options of the further workflow execution.

source: Список входных столбцов.
en: List of input columns.

source: Список входных столбцов;
en: List of input columns;

source: Список выражений;
en: List of expressions.

source: Список параметров полей — в табличном виде представлены параметры полей набора данных.
en: List of fields features: fields features of data set are represented in the table form.

source: Список пользовательских ветвей — добавленные пользователем ветви, можно выбрать одну из них;
en: List of user branches: the branches added by a user. It is possible to select one of them.

source: Список функций.
en: List of functions.

source: Сплайны Сплайны.
en: Splines Splines.

source: Способ детализации — переключить варианты отображения Детализации.
en: Detailing method: switch the Detailing display options.

source: Способы замен;
en: Replacement methods.

source: Справка — вызов справки;
en: Help: help topics.

source: Сравниваемое значение — значение, с которым будет сравниваться выбранный объект.
en: Compared value: the value with which the selected object will be compared.

source: Среднее (Имя факта.Avg ) — среднее из всех значений фактов.
en: Average (Measure name.Avg ): the average value of all measures values.

source: Среднее Среднее;
en: Average Average;

source: Среднеквадратическая ошибка на обучающем множестве
en: The root-mean-square error of the training set

source: Ссылка на пакет
en: Reference to package

source: Стандартизация — из каждого значение вычитается среднее значение и делится на стандартное отклонение.
en: Standardization: the average value is subtracted from each value, and then it is divided by the standard deviation.

source: Стандартная ошибка
en: Standard error

source: Стандартное откл. (Имя факта.StdDev ) — стандартное отклонение значений фактов.
en: Standard deviation (Measure name.StdDev ): the standard deviation of measures values.

source: Стандартное отклонение
en: Standard deviation

source: Стандартное отклонение Стандартное отклонение;
en: Standard deviation Standard deviation;

source: Стандартные компоненты — предоставляются в рамках платформы;
en: Standard components are provided by the platform.

source: Статистика Статистика — данные будут представлены визуализатором Статистика.
en: Statistics Statistics: the data will be displayed by the Statistics visualizer.

source: Статистика Статистика.
en: Statistics Statistics.

source: Статистические показатели
en: Statistical indicators

source: Статистические функции
en: Statistical functions

source: Стиль ссылок — предлагается выбрать один из вариантов обозначения ячеек листа Excel.
en: Reference style: it is requested to select one of the identification options of the Excel worksheet cells.

source: Столбец "Прочие" — столбец с аккумулированными значениями не уместившихся столбцов в дискретных гистограммах.
en: "Other" column: the column with the accumulated values for which there was no enough space in the discrete histograms.

source: Столбец, содержащий XML — выбор столбца с документами XML.
en: XML column: selection of the column with the XML documents.

source: Столбчатая Столбчатая.
en: Columns Columns.

source: Страница «Начало».
en: "Home" page

source: Страница «Начало»
en: "Home" page

source: Стратифицированный — все записи исходного набора данных разделяются на однородные группы (страты), после чего из каждой группы случайным образом выбираются и помещаются в результирующую выборку.
en: Stratified: all records of the source data set are divided into uniform groups (strata), and then they are randomly selected from each group and placed into the resulting sample.

source: Строка заголовка — выбор способа задания наименования столбцов в экспортируемом файле:
en: Header Row enables to select the method used for setting of columns name in the exported file:

source: Строка заголовков — определение заголовков для таблицы в Excel.
en: Headers row enables to define headers for the table in Excel.

source: Строка подключения — настраивается в отдельном окне, которое вызывается при клике мышью по кнопке .
en: Connection string is set in a separate window that can be called by clicking on button.

source: Строка подключения — настраивается в отдельном окне, которое вызывается при клике мышью по кнопке уточнить.
en: Connection string is set in a separate window that can be called by clicking on to be defined.

source: Строка подключения — настраивается как в отдельном окне, которое вызывается при клике мышью по кнопке , так и вводом параметров вручную.
en: Connection string is set in a separate window that can be called both by clicking on button, and by entering the parameters manually.

source: Строка подключения — настраивается как в отдельном окне, которое вызывается при клике мышью по кнопке уточнить, так и вводом параметров вручную.
en: Connection string is set in a separate window that can be called both by clicking on to be defined button, and by entering the parameters manually.

source: Строка подключения — содержит параметры подключения к базе данных.
en: Connection string contains parameters of connection to database.

source: Строка подключения — строка вида host[:port][:database] задается как в отдельном окне, которое вызывается при клике мышью по кнопке , так и вводом параметров вручную.
en: Connection string represents the string of the following kind: host[:port][:database]. It is set in a separate window that can be called both by clicking on button, and by entering the parameters manually.

source: Строка подключения — строка, используемая драйвером для подключения к необходимой базе данных.
en: Connection string: the string used by the driver for connection to the required database.

source: Строка подключения — указывается путь к файлу БД, содержащей необходимые данные.
en: Connection string: the path to the DB file containing the required data is specified.

source: Строка подключения — указывается путь к файлу БД, содержащему необходимые данные.
en: Connection string: the path to the DB file containing the required data is specified.

source: Строка подключения — указывается путь к файлу, содержащему необходимые данные.
en: Connection string: the path to the file containing the required data is specified.

source: Строка подключения — указывается строка подключения в формате установленного в системе драйвера ODBC, либо выбирается один из настроенных в системе источников данных ODBC.
en: Connection string: it is required to specify the connection string in the format set in the ODBC driver system, or it is possible to select one of the ODBC data sources configured in the system.

source: Строка Строка.
en: String String.

source: Строка — для ввода строки, будет вставлено "";
en: String: "" will be inserted to enter the string.

source: Строки Строки.
en: Strings Strings.

source: Строковые функции
en: String functions

source: Структура выходного набора
en: Output data set structure

source: Структура результирующего набора
en: Resulting data set structure

source: Структура файла замен
en: Replacement file structure

source: Сумма квадратов (Имя факта.SumSq ) — сумма квадратов всех значений фактов.
en: Sum of squares (Measure name.SumSq ): the sum of squares of all measures values.

source: Сумма продаж группы, тыс.
en: Amount of group sales, thous.

source: Сумма (Имя факта.Sum ) — сумма всех значений фактов.
en: Sum (Measure name.Sum ): the sum of all measures values.

source: Сумма Сумма;
en: Sum Sum;

source: Схема движения данных для узла, принимающего и отдающего набор данных (таблицу).
en: Schema of data movement for the node that accepts and gives back the data set (table).

source: Сценарий - последовательность действий, которые необходимо провести для анализа данных.
en: Workflow: sequence of actions that must be performed for data analysis.

source: Сценарий — главная составная часть Модуля (см.
en: Workflow is the main component of the Module (refer to
